Granyy/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_PollControl_Server_SED/STM32_WPAN/App/app_zigbee.c
/**
 ******************************************************************************
 * File Name          : App/app_zigbee.c
 * Description        : Zigbee Application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"

#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/zcl.poll.control.h"
#include "zcl/zcl.device.temp.h"
#include "zcl/zcl.temp.meas.h"
#include "zcl/zcl.water.content.meas.h"
#include "zigbee.aps.h"
#include "zcl/zcl.basic.h"



/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U
#define SW1_ENDPOINT                                17
#define CHANNEL                                     19
#define HW_TS_SERVER_1MS_NB_TICKS                   (1*1000/CFG_TS_TICK_VAL) /* 1ms */
#define SED_SLEEP_TIME_30S                          1 /* SED base sleep unit is 30s */

/* Poll Control specific defines ---------------------------------------------*/
/* Poll Control time related attribute values are in 1/4 of a second */
/* Convert milliseconds to quarter seconds, and vice versa */
#define POLL_CONVERT_MS_TO_QS(ms)                   (ms / 250U)
#define POLL_CONVERT_QS_TO_MS(qs)                   (qs * 250U)
#define CHECKIN_INTERVAL                            (4*10)   /* 10s */
#define LONG_POLL_INTERVAL                          (4*5)   /* 5s */

/* external definition */
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);
static void APP_ZIGBEE_App_Init(void);
static void APP_ZIGBEE_SW1_Process(void);

static void APP_ZIGBEE_PollControl_Server_Init(void);
static void APP_ZIGBEE_PollControl_Server_ShowAttr(void);
static void APP_ZIGBEE_SW1_Process_Temp(void);
static void APP_ZIGBEE_PollControl_Server_FillingBindingTable(void);
static void APP_ZIGBEE_PollControl_Server_CheckinRsp_cb(struct ZbZclClusterT *clusterPtr, struct zcl_poll_checkin_rsp_t *rsp_info, 
                                               struct ZbZclAddrInfoT *srcInfo, void *arg);
static void APP_ZIGBEE_PollControl_FastPoll_End(void);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);


static void APP_ZIGBEE_InitDevTemp(void);
static void APP_ZIGBEE_InitDevHumi(void);

/* Private variables -----------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;
  
  struct ZbZclClusterT *pollcontrol_server;
  struct ZbZclClusterT *device_temp_server;
  struct ZbZclClusterT *device_humi_server;
};
static struct zigbee_app_info zigbee_app_info;

static struct ZbZclPollControlServerCallbackT ZbZclPollControlServerCallbacks = {
  .checkin_rsp = APP_ZIGBEE_PollControl_Server_CheckinRsp_cb,
};

static uint8_t TS_ID1;

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Poll Control client Checkin response callback
 * @param  clusterPtr: ZCL cluster pointer
 * @param  rsp_info: Checkin response
 * @param  srcInfo: sender address info
 * @param  arg: passed arguments
 * @retval None
 */
static void APP_ZIGBEE_PollControl_Server_CheckinRsp_cb(struct ZbZclClusterT *clusterPtr, struct zcl_poll_checkin_rsp_t *rsp_info, 
                                                        struct ZbZclAddrInfoT *srcInfo, void *arg){
  
  /* Check response status */                                                        
  if(rsp_info->status != ZCL_STATUS_SUCCESS){   
    APP_DBG("Error, checkin request no successfully handled by Poll Control client.");
    return;
  }
  
  APP_DBG("[POLL CONTROL] Checkin response recieved.");
  
  if(rsp_info->start_fast_poll){
    APP_DBG("[POLL CONTROL] Fast Poll enabled for %d seconds.\n", rsp_info->fast_poll_timeout/4); 
    //BSP_LED_On(LED_GREEN);
    APP_DBG("GREEN LED ON\n");
    HW_TS_Start(TS_ID1, POLL_CONVERT_QS_TO_MS(rsp_info->fast_poll_timeout)*HW_TS_SERVER_1MS_NB_TICKS);
  } else {
    APP_DBG("[POLL CONTROL] Continue with Long Poll.\n");
  }        
}

/**
 * @brief  Show Poll Control server local attributes
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PollControl_Server_ShowAttr(void){
  enum ZclStatusCodeT status;
  uint32_t checkin_interval, long_interval;
  uint16_t short_interval, fast_timeout;
  
  APP_DBG("[POLL CONTROL] Server attributes.");
  
