Granyy/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_PollControl_Server_SED/STM32_WPAN/App/app_zigbee.c
  /* Get local ZCL_POLL_CHECK_IN_INTERVAL attributes value */
  checkin_interval = (uint32_t)ZbZclAttrIntegerRead(zigbee_app_info.pollcontrol_server, 
                                                    ZCL_POLL_CHECK_IN_INTERVAL, NULL, &status);
  if (status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reading local attribute.");
  } else {
    APP_DBG("[POLL CONTROL] Checkin interval: %ds", checkin_interval/4);
  }
  
  /* Get local ZCL_POLL_LONG_POLL_INTERVAL attributes value */
  long_interval = (uint32_t)ZbZclAttrIntegerRead(zigbee_app_info.pollcontrol_server, 
                                                 ZCL_POLL_LONG_POLL_INTERVAL, NULL, &status);
  if (status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reading local attribute.");
  } else {
    APP_DBG("[POLL CONTROL] Long poll interval: %ds", long_interval/4);
  }
  
  /* Get local ZCL_POLL_SHORT_POLL_INTERVAL attributes value */
  short_interval = (uint16_t)ZbZclAttrIntegerRead(zigbee_app_info.pollcontrol_server, 
                                                  ZCL_POLL_SHORT_POLL_INTERVAL, NULL, &status);
  if (status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reading local attribute.");
  } else {
    APP_DBG("[POLL CONTROL] Short poll interval: %ds", short_interval/4);
  }
  
  /* Get local ZCL_POLL_FAST_POLL_TIMEOUT attributes value */
  fast_timeout = (uint16_t)ZbZclAttrIntegerRead(zigbee_app_info.pollcontrol_server, 
                                                ZCL_POLL_FAST_POLL_TIMEOUT, NULL, &status);
  if (status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error reading local attribute.");
  } else {
    APP_DBG("[POLL CONTROL] Fast poll timeout: %ds\n", fast_timeout/4);
  }

  APP_ZIGBEE_SW1_Process_Temp();

}

/**
 * @brief  Adding coordinator (with Poll Control Cluster) in device binding table
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PollControl_Server_FillingBindingTable(void){
  ZbApsmeBindReqT bindreq;
  ZbApsmeBindConfT bindconf;
  uint64_t ext_addr;
  
  APP_DBG("[POLL CONTROL] Adding Poll Control client in the binding table.");
  
  /* Get the extended addr of the Poll Control client (the coordinator) */
  ext_addr = ZbNwkAddrLookupExt(zigbee_app_info.zb, 0x0);
  
  /* Filling binding request */
  memset(&bindreq, 0, sizeof(bindreq));
  memset(&bindconf, 0, sizeof(bindconf));
  bindreq.srcExtAddr = ZbExtendedAddress(zigbee_app_info.zb);
  bindreq.srcEndpt = SW1_ENDPOINT;
  bindreq.clusterId = ZCL_CLUSTER_POLL_CONTROL;
  bindreq.dst.mode = ZB_APSDE_ADDRMODE_EXT;
  bindreq.dst.endpoint = SW1_ENDPOINT;
  bindreq.dst.extAddr = ext_addr;
  
  ZbApsmeBindReq(zigbee_app_info.zb,&bindreq,&bindconf);
    
  if(bindconf.status != ZB_WPAN_STATUS_SUCCESS){
    APP_DBG("[POLL CONTROL] Local Bind failed.");
    assert(0);
  }
}

/**
 * @brief  Poll Control server initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PollControl_Server_Init(void){
  enum ZclStatusCodeT status;
  
  /* IMPORTANT: In order for the check-in request to be submited to the client,
                the client must be present in the server local binding table. */
  APP_ZIGBEE_PollControl_Server_FillingBindingTable();
  
  /* ZCL_POLL_CHECK_IN_INTERVAL attribute init */
  APP_DBG("[POLL CONTROL] Writing Check-in Interval attribute.");
  status = ZbZclAttrIntegerWrite(zigbee_app_info.pollcontrol_server, ZCL_POLL_CHECK_IN_INTERVAL, CHECKIN_INTERVAL);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("[POLL CONTROL] Error writting local attribute.");
    assert(0);
  }
  
  APP_DBG("[POLL CONTROL] Poll Control server init done!\n");  
} /* APP_ZIGBEE_PollControl_Server_Init */

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void){ 
   /* Timer associated with Poll Control polling state indication */
  HW_TS_Create(CFG_TIM_ZIGBEE_APP_POLL_CONTROL_LED_INDICATION, &TS_ID1, hw_ts_SingleShot, APP_ZIGBEE_PollControl_FastPoll_End);
   
  /* Task associated with Poll Control server attributes print */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_APP_POLL_CONTROL_SHOW_ATTR, 
                   UTIL_SEQ_RFU, APP_ZIGBEE_PollControl_Server_ShowAttr);
  
  /* Initialize Zigbee Poll Control Server parameters */
  APP_ZIGBEE_PollControl_Server_Init();
} /* APP_ZIGBEE_App_Init */

static void APP_ZIGBEE_PollControl_FastPoll_End(void){
  BSP_LED_Off(LED_GREEN);
  APP_DBG("GREEN LED OFF\n");
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Register task */
  /* Create the different tasks */
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessNotifyM0ToM4);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessRequestM0ToM4);

  /* Task associated with network creation process */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, UTIL_SEQ_RFU, APP_ZIGBEE_NwkForm);
  
  /* Task associated with push button SW1 */
  UTIL_SEQ_RegTask(1U << CFG_TASK_BUTTON_SW1, UTIL_SEQ_RFU, APP_ZIGBEE_SW1_Process);

  /* Task associated with application init */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_APP_START, UTIL_SEQ_RFU, APP_ZIGBEE_App_Init);
  /* Start the Zigbee on the CPU2 side */
  ZigbeeInitStatus = SHCI_C2_ZIGBEE_Init();
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ZigbeeInitStatus);

  /* Initialize Zigbee stack layers */
  APP_ZIGBEE_StackLayersInit();
  


} /* APP_ZIGBEE_Init */

/**
 * @brief  Initialize Zigbee stack layers
 * @param  None
 * @retval None
 */

struct ZbZclBasicServerDefaults defaultCustom;

char mfr_name[] = {7, 'G', 'R', 'A', 'N', 'Y', 'Y', '\0'};
char model_name[] = {6, 'T', 'E', 'M', 'P', 'I', '\0'};
char date_code[] = {9, '2', '6', '0', '2', '2', '0', '2', '1', '\0'};

static void APP_ZIGBEE_StackLayersInit(void)
{
  APP_DBG("APP_ZIGBEE_StackLayersInit");

  zigbee_app_info.zb = ZbInit(0U, NULL, NULL);
  assert(zigbee_app_info.zb != NULL);

  defaultCustom.app_version = 0;
    defaultCustom.stack_version = 10;
    defaultCustom.hw_version = 0;

    memcpy(defaultCustom.mfr_name, mfr_name, sizeof(mfr_name));
    memcpy(defaultCustom.model_name, model_name, sizeof(model_name));
    memcpy(defaultCustom.date_code, date_code, sizeof(date_code));
    defaultCustom.power_source = ZCL_BASIC_POWER_BATTERY;
    memcpy(defaultCustom.sw_build_id, date_code, sizeof(date_code));
    ZbZclBasicServerConfigDefaults(zigbee_app_info.zb, &defaultCustom);


  /* Create the endpoint and cluster(s) */
  APP_ZIGBEE_ConfigEndpoints();

