Granyy/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_PollControl_Server_SED/STM32_WPAN/App/app_zigbee.c
  BSP_LED_Off(LED_RED);
  BSP_LED_Off(LED_GREEN);
  BSP_LED_Off(LED_BLUE);

  /* Configure the joining parameters */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  zigbee_app_info.join_delay = HAL_GetTick(); /* now */

  /* Initialization Complete */
  zigbee_app_info.has_init = true;

  /* run the task */
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
} /* APP_ZIGBEE_StackLayersInit */

/**
 * @brief  Configure Zigbee application endpoints
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigEndpoints(void)
{
  ZbApsmeAddEndpointReqT req;
  ZbApsmeAddEndpointConfT conf;

  memset(&req, 0, sizeof(req));
  req.profileId = ZCL_PROFILE_HOME_AUTOMATION;
  req.deviceId = ZCL_DEVICE_WHITE_GOODS;

  /* Endpoint: SW1_ENDPOINT */
  req.endpoint = SW1_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Poll Control Server */
  zigbee_app_info.pollcontrol_server = zcl_poll_server_alloc(zigbee_app_info.zb, SW1_ENDPOINT,
                                                             &ZbZclPollControlServerCallbacks, NULL);
  assert(zigbee_app_info.pollcontrol_server != NULL);
  ZbZclClusterEndpointRegister(zigbee_app_info.pollcontrol_server); 


  /* Endpoint: SW1_ENDPOINT */
  //req.endpoint = SW1_ENDPOINT;
  //ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);
  ZbApsmeEndpointClusterListAppend(zigbee_app_info.zb, SW1_ENDPOINT, ZCL_CLUSTER_MEAS_TEMPERATURE, true);
  ZbApsmeEndpointClusterListAppend(zigbee_app_info.zb, SW1_ENDPOINT, ZCL_CLUSTER_MEAS_HUMIDITY, true);

  /* device temperature Server */
  zigbee_app_info.device_temp_server = ZbZclTempMeasServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, ZCL_TEMP_MEAS_MIN_MEAS_VAL_MIN, ZCL_TEMP_MEAS_MAX_MEAS_VAL_MAX, 1);
  assert(zigbee_app_info.device_temp_server != NULL);
  zigbee_app_info.device_humi_server = ZbZclWaterContentMeasServerAlloc(zigbee_app_info.zb, SW1_ENDPOINT, ZCL_CLUSTER_MEAS_HUMIDITY, ZCL_WC_MEAS_MIN_MEAS_VAL_MIN, ZCL_WC_MEAS_MIN_MEAS_VAL_MAX);
  assert(zigbee_app_info.device_humi_server != NULL);

} /* APP_ZIGBEE_ConfigEndpoints */

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NwkForm(void)
{
  if ((zigbee_app_info.join_status != ZB_STATUS_SUCCESS) && (HAL_GetTick() >= zigbee_app_info.join_delay))
  {
    struct ZbStartupT config;
    enum ZbStatusCodeT status;

    /* Configure Zigbee Logging (only need to do this once, but this is a good place to put it) */
    ZbSetLogging(zigbee_app_info.zb, ZB_LOG_MASK_LEVEL_5, NULL);

    /* Attempt to join a zigbee network */
    ZbStartupConfigGetProDefaults(&config);

    APP_DBG("Network config : APP_STARTUP_CENTRALIZED_ROUTER");
    config.startupControl = ZbStartTypeJoin;

    /* Using the default HA preconfigured Link Key */
    memcpy(config.security.preconfiguredLinkKey, sec_key_ha, ZB_SEC_KEYSIZE);   
    config.channelList.count = 1;
    config.channelList.list[0].page = 0;
    config.channelList.list[0].channelMask = WPAN_CHANNELMASK_2400MHZ;//1 << CHANNEL; /* Channel in use */
    
    /* Add Sleepy End device configuration */
    config.capability &= ~(MCP_ASSOC_CAP_RXONIDLE | MCP_ASSOC_CAP_DEV_TYPE | MCP_ASSOC_CAP_ALT_COORD);
    config.endDeviceTimeout = 1*SED_SLEEP_TIME_30S /* 1 x (30sec sleep time unit) => 30s sleepy cycle */;


    /* Using ZbStartupWait (blocking) here instead of ZbStartup, in order to demonstrate how to do
     * a blocking call on the M4. */
    status = ZbStartupWait(zigbee_app_info.zb, &config);

    APP_DBG("ZbStartup Callback (status = 0x%02x)", status);
    zigbee_app_info.join_status = status;

    if (status == ZB_STATUS_SUCCESS) {
      zigbee_app_info.join_delay = 0U;
      //BSP_LED_On(LED_BLUE);
    }
    else
    {
      APP_DBG("Startup failed, attempting again after a short delay (%d ms)", APP_ZIGBEE_STARTUP_FAIL_DELAY);
      zigbee_app_info.join_delay = HAL_GetTick() + APP_ZIGBEE_STARTUP_FAIL_DELAY;
    }
  }

  /* If Network forming/joining was not successful reschedule the current task to retry the process */
  if (zigbee_app_info.join_status != ZB_STATUS_SUCCESS)
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_NETWORK_FORM, CFG_SCH_PRIO_0);
  }
  else
  {

	// group addr needed ? Not sur ;)



    /* Since we're using group addressing (broadcast), shorten the broadcast timeout */
    uint32_t bcast_timeout = 3;
    ZbNwkSet(zigbee_app_info.zb, ZB_NWK_NIB_ID_NetworkBroadcastDeliveryTime, &bcast_timeout, sizeof(bcast_timeout));
    
    APP_ZIGBEE_InitDevTemp();
    APP_ZIGBEE_InitDevHumi();

    /* Starting application init task */
    UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_APP_START, CFG_SCH_PRIO_0);
  }
} /* APP_ZIGBEE_NwkForm */

/* Initialize current temperature */
static void APP_ZIGBEE_InitDevTemp()
{
  enum ZclStatusCodeT status;
  status = ZbZclAttrIntegerWrite(zigbee_app_info.device_temp_server, ZCL_TEMP_MEAS_ATTR_MEAS_VAL, (int16_t)2000);
  if(status == ZCL_STATUS_SUCCESS)
  {
    APP_DBG("[DEV TEMP] Device Temperature initial value set at %d",(int16_t)2000);
    //BSP_LED_On(LED_GREEN);
  }
  else
  {
    APP_DBG("[DEV TEMP]Failed to initialize initial Temperature");
  }
}

/* Initialize current humidity */
static void APP_ZIGBEE_InitDevHumi()
{
  enum ZclStatusCodeT status;
  status = ZbZclAttrIntegerWrite(zigbee_app_info.device_humi_server, ZCL_WC_MEAS_ATTR_MEAS_VAL, (int16_t)5000);
  if(status == ZCL_STATUS_SUCCESS)
  {
    APP_DBG("[DEV HUM] Device humidity initial value set at %d",(int16_t)5000);
    //BSP_LED_On(LED_GREEN);
  }
  else
  {
    APP_DBG("[DEV HUM]Failed to initialize initial humidity");
  }
}

/*************************************************************
 * ZbStartupWait Blocking Call
 *************************************************************/
struct ZbStartupWaitInfo {
  bool active;
  enum ZbStatusCodeT status;
};

static void ZbStartupWaitCb(enum ZbStatusCodeT status, void *cb_arg)
{
  struct ZbStartupWaitInfo *info = cb_arg;

